e2-s/nRF51-indoor-positioning-system/ble_app_indoor_pos/main.c
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <math.h>
#include "nordic_common.h"
#include "app_error.h"
#include "app_uart.h"
#include "app_trace.h"
#include "ble_db_discovery.h"
#include "app_timer.h"
#include "app_trace.h"
#include "app_util.h"
#include "app_error.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "boards.h"
#include "ble.h"
#include "ble_gap.h"
#include "ble_hci.h"
#include "softdevice_handler.h"
#include "ble_advdata.h"
#include "ble_nus_c.h"
#include "nrf_delay.h"

#define CENTRAL_LINK_COUNT      1                               /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT   0                               /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define UART_TX_BUF_SIZE        256                             /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE        256                             /**< UART RX buffer size. */

#define NUS_SERVICE_UUID_TYPE   BLE_UUID_TYPE_VENDOR_BEGIN      /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_TIMER_PRESCALER     0                               /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE 2                               /**< Size of timer operation queues. */

#define APPL_LOG                app_trace_log                   /**< Debug logger macro that will be used in this file to do logging of debug information over UART. */

#define SCAN_INTERVAL           0x00A0                          /**< Determines scan interval in units of 0.625 millisecond. */
#define SCAN_WINDOW             0x0050                          /**< Determines scan window in units of 0.625 millisecond. */
#define SCAN_ACTIVE             1                               /**< If 1, performe active scanning (scan requests). */
#define SCAN_SELECTIVE          0                               /**< If 1, ignore unknown devices (non whitelisted). */
#define SCAN_TIMEOUT            0x0000                          /**< Timout when scanning. 0x0000 disables timeout. */

#define MIN_CONNECTION_INTERVAL MSEC_TO_UNITS(20, UNIT_1_25_MS) /**< Determines minimum connection interval in millisecond. */
#define MAX_CONNECTION_INTERVAL MSEC_TO_UNITS(75, UNIT_1_25_MS) /**< Determines maximum connection interval in millisecond. */
#define SLAVE_LATENCY           0                               /**< Determines slave latency in counts of connection events. */
#define SUPERVISION_TIMEOUT     MSEC_TO_UNITS(4000, UNIT_10_MS) /**< Determines supervision time-out in units of 10 millisecond. */

#define UUID16_SIZE             2                               /**< Size of 16 bit UUID */
#define UUID32_SIZE             4                               /**< Size of 32 bit UUID */
#define UUID128_SIZE            16                              /**< Size of 128 bit UUID */


//Added by Kumar
#define NO_OF_REF_NODES					4
//#define ENVI_CONST							1.8//2.0 //1.6 //2.2//1.8
//#define AVG_1M									(-61) //Absolute value of engergy, need to be clarified
#define AVG_SAMPLE_COUNT				20
#define CONST_SAMPLE_COUNT			100
#define B1X											1.5 //H3.65
#define B1Y											0
#define B2X											0
#define B2Y											3.35 //H4.87
#define B3X											3.65//H5.48 //6.0
#define B3Y											3 //H8.53 //2.43
#define B4X											3
#define B4Y											3
//Added by Kumar
static ble_nus_c_t              m_ble_nus_c;                    /**< Instance of NUS service. Must be passed to all NUS_C API calls. */
static ble_db_discovery_t       m_ble_db_discovery;             /**< Instance of database discovery module. Must be passed to all db_discovert API calls */

//Added by Kumar for using RSSI 
//Global Variables
int8_t rssi_inst[NO_OF_REF_NODES];
float dist_rssi[NO_OF_REF_NODES]; //Distance from each reference nodes
float alpha = 0.75; //only for RSSI smoothing
float dev_x,dev_y;
ble_gap_addr_t ref_node_addr[NO_OF_REF_NODES];
uint8_t ref_node_entry[NO_OF_REF_NODES][BLE_GAP_ADDR_LEN] = {	{0xC7,0x54,0x63,0x63,0xA1,0xD9},
																															{0x14,0xC5,0x86,0x4F,0x1C,0xE5},
																															{0x40,0x8C,0x1F,0xF8,0x94,0xCF},
																															{0x15,0x43,0x66,0x60,0xB3,0xE6}};
																															
//for taking avg of rssi

		//int8_t no_avg = 100;
		uint8_t count=0;
		//uint8_t calc_dist=0; //Flag to enable distance calculation - in case of moving avg or specific interval etc.,
	int16_t rssi_sum[NO_OF_REF_NODES] = {0, 0, 0, 0};
	int8_t rssi_samples[NO_OF_REF_NODES][AVG_SAMPLE_COUNT+1];																																
		int8_t rssi_avg[NO_OF_REF_NODES],rssi_avg_prev[NO_OF_REF_NODES];																											
		//int8_t 	rssi_samples[100];
	
	//for sliding window
	int8_t rssi_slide[NO_OF_REF_NODES];
//for taking avg of rssi
																								
		//for envinronmental factors
		int8_t RSSI_AVG_1M[NO_OF_REF_NODES] = {-61, -56, -61, 0};
		uint8_t sample_count = 0;
		float ENVI_CONST[NO_OF_REF_NODES] = {1.6, 2.0, 1.8, 0};
		float estimated_envi_const[NO_OF_REF_NODES];
		float calibration_distance = 2;
		

		float const_sum[NO_OF_REF_NODES] = {0, 0, 0, 0};
		float const_avg[NO_OF_REF_NODES];
		float const_samples[CONST_SAMPLE_COUNT][NO_OF_REF_NODES];
																															
//Added by Kumar for using RSSI 
	
//Addded by Kumar for Kalman Filtering	
	
 //initial values for the Kalman filter 
    float RSSI_est_prev[NO_OF_REF_NODES] = {0, 0, 0, 0};
    float P_prev[NO_OF_REF_NODES] = {0, 0, 0, 0}; 
    //the noise in the system  (to be updated by repetitive testing/ trail and error method)
    float const_Q = 0.022; //0.065
    float const_R = 0.617; //1.4
     
    float K[NO_OF_REF_NODES]; //Kalman_Gain
    float P[NO_OF_REF_NODES];  //Estimate_error
    float P_temp[NO_OF_REF_NODES]; 
    float RSSI_temp_est[NO_OF_REF_NODES]; 
    float RSSI_est[NO_OF_REF_NODES]; 
    float z_measured[NO_OF_REF_NODES]; //the RSSI value measured

	
//Addded by Kumar for Kalman Filtering		
	
/**
 * @brief Connection parameters requested for connection.
 */
static const ble_gap_conn_params_t m_connection_param =
  {
    (uint16_t)MIN_CONNECTION_INTERVAL,  // Minimum connection
    (uint16_t)MAX_CONNECTION_INTERVAL,  // Maximum connection
    (uint16_t)SLAVE_LATENCY,            // Slave latency
    (uint16_t)SUPERVISION_TIMEOUT       // Supervision time-out
  };

/**
 * @brief Parameters used when scanning.
 */
static const ble_gap_scan_params_t m_scan_params = 
  {
    .active      = SCAN_ACTIVE,
    .selective   = SCAN_SELECTIVE,
    .p_whitelist = NULL,
    .interval    = SCAN_INTERVAL,
    .window      = SCAN_WINDOW,
    .timeout     = SCAN_TIMEOUT
  };

/**
 * @brief NUS uuid
 */
static const ble_uuid_t m_nus_uuid = 
  {
    .uuid = BLE_UUID_NUS_SERVICE,
    .type = NUS_SERVICE_UUID_TYPE
  };

/**@brief Function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

/**@brief Function to start scanning.
 */
static void scan_start(void)
{
    uint32_t err_code;
    
    err_code = sd_ble_gap_scan_start(&m_scan_params);
    APP_ERROR_CHECK(err_code);
    
    err_code = bsp_indication_set(BSP_INDICATE_SCANNING);
    APP_ERROR_CHECK(err_code);
}


