e2-s/nRF51-indoor-positioning-system/ble_app_indoor_pos/main.c
    const app_uart_comm_params_t comm_params =
      {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_ENABLED,
        .use_parity   = false,
        .baud_rate    = UART_BAUDRATE_BAUDRATE_Baud115200
      };

    APP_UART_FIFO_INIT(&comm_params,
                        UART_RX_BUF_SIZE,
                        UART_TX_BUF_SIZE,
                        uart_event_handle,
                        APP_IRQ_PRIORITY_LOW,
                        err_code);

    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the NUS Client.
 */
static void nus_c_init(void)
{
    uint32_t         err_code;
    ble_nus_c_init_t nus_c_init_t;
    
    nus_c_init_t.evt_handler = ble_nus_c_evt_handler;
    
    err_code = ble_nus_c_init(&m_ble_nus_c, &nus_c_init_t);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing buttons and leds.
 */
static void buttons_leds_init(void)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
}


/** @brief Function for initializing the Database Discovery Module.
 */
static void db_discovery_init(void)
{
    uint32_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}

/** @brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}

//Kalman filtering for measuring RSSI value
static void Kalman_RSSI(void)
{
	for(uint8_t cnt_node = 0; cnt_node < NO_OF_REF_NODES; cnt_node++)
	{
				//Prediction  phase
        RSSI_temp_est[cnt_node] = RSSI_est_prev[cnt_node]; 
        P_temp[cnt_node] = P_prev[cnt_node] + const_Q; 
        //calculate the Kalman gain 
        K[cnt_node] = P_temp[cnt_node] * (1.0/(P_temp[cnt_node] + const_R));
        //measure RSSI
        z_measured[cnt_node] = rssi_inst[cnt_node];
        //correct phase
        RSSI_est[cnt_node] = RSSI_temp_est[cnt_node] + K[cnt_node] * (z_measured[cnt_node] - RSSI_temp_est[cnt_node]);  
        P[cnt_node] = (1 - K[cnt_node]) * P_temp[cnt_node]; 
        //we have our new system 
         
        printf("\r\n Mesaured RSSI of Node %d : %6.3f",(cnt_node+1),z_measured[cnt_node]); 
        printf("\r\n Kalman   RSSI of Node %d : %6.3f",(cnt_node+1),RSSI_est[cnt_node]); 
         
                
        //update prev values
        P_prev[cnt_node] = P[cnt_node]; 
        RSSI_est_prev[cnt_node] = RSSI_est[cnt_node]; 
	}
}


//Function to calculate environmental constant 'n'
static void calc_envi_const()
{
	
		float num,den;
		
		if ( sample_count == CONST_SAMPLE_COUNT)
		{
				for(uint8_t index = 0;index < CONST_SAMPLE_COUNT;index++)
						for(uint8_t cnt=0 ; cnt < NO_OF_REF_NODES ; cnt++)
								const_sum[cnt] += const_samples[index][cnt];
			
				for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
				{
						//printf("\r\n Envi Constant Sum of node %d : %f",(cnt_node+1),const_sum[cnt_node]);
						const_avg[cnt_node] = const_sum[cnt_node] / CONST_SAMPLE_COUNT;
						printf("\r\n ***Constant Average of node %d : %f",(cnt_node+1),const_avg[cnt_node]);	
						const_sum[cnt_node] = 0;
				}
				sample_count = 0;
			
		}
		else
		{
			for (uint8_t index1=0 ; index1 < NO_OF_REF_NODES ; index1++)
			{
				num = abs(rssi_inst[index1]) - abs(RSSI_AVG_1M[index1]);
				den = 10 * log10(calibration_distance);	
				estimated_envi_const[index1] = num / den;
				const_samples[sample_count][index1]= estimated_envi_const[index1];
				//printf("\r\n Environmental constant of Node %d: %f",(index+1),estimated_envi_const[index]);
																		
			}
			sample_count++;
			
		}
			
}

//Function to calculate average of RSSI
static void avg_rssi(uint8_t no_avg)
{
	
	int16_t rssi_sum[NO_OF_REF_NODES] = {0, 0, 0, 0};
	int16_t rssi_samples[no_avg][NO_OF_REF_NODES];
	
		/*
	//old logic inside infinite loop in main

		if(count == no_avg)
		{
				rssi_sum = 0;
				for(index = 0;index < no_avg;index++)
						rssi_sum += rssi_samples[index];
//						printf("\n RSSI Sum : %d",rssi_sum);
				rssi_avg = rssi_sum / no_avg;
//						printf("\n RSSI Average : %d",rssi_avg);
				count = 0;
				
		}
		else
		{
				//printf("\nRSSI : %d",rssi_inst);
				rssi_samples[count]= rssi_inst;
				count++;
		}
		//old logic inside infinite loop in main
		*/
		if(count == no_avg)
		{
				
				for(uint8_t index = 0;index < no_avg;index++)
						for(uint8_t cnt=0 ; cnt < NO_OF_REF_NODES ; cnt++)
								rssi_sum[cnt] += rssi_samples[index][cnt];
				for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
				{
						printf("\r\n RSSI Sum of node %d : %d",(cnt_node+1),rssi_sum[cnt_node]);
						rssi_avg_prev[cnt_node] = rssi_avg[cnt_node];
						rssi_avg[cnt_node] = rssi_sum[cnt_node] / no_avg;
						printf("\r\n ***RSSI Average of node %d : %d",(cnt_node+1),rssi_avg[cnt_node]);	
				}
				count = 0;
				//calc_dist = 1;
//				calc_envi_const(rssi_inst);
		}
		else
		{
				
				for(uint8_t cnt=0 ; cnt < NO_OF_REF_NODES ; cnt++)
					rssi_samples[count][cnt]= rssi_inst[cnt];
					
				count++;
		}
		
}						

//Function to calculate moving average
static void mov_avg_rssi()
{
	
	for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
		for(uint8_t cnt_sample=0 ; cnt_sample < AVG_SAMPLE_COUNT ; cnt_sample++)
			rssi_samples[cnt_node][cnt_sample] = rssi_samples[cnt_node][cnt_sample+1];
	
	for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
			rssi_samples[cnt_node][AVG_SAMPLE_COUNT] = rssi_inst[cnt_node];

	for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
		for(uint8_t cnt_sample=0 ; cnt_sample < AVG_SAMPLE_COUNT ; cnt_sample++)
			rssi_sum[cnt_node] += rssi_samples[cnt_node][cnt_sample];

	for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
	{
			//printf("\r\n RSSI Sum of node %d : %d",(cnt_node+1),rssi_sum[cnt_node]);
			rssi_avg[cnt_node] = rssi_sum[cnt_node] / AVG_SAMPLE_COUNT;
			//printf("\r\n ***RSSI Average of node %d : %d",(cnt_node+1),rssi_avg[cnt_node]);	
	}
	for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
		rssi_sum[cnt_node] = 0;

				
		
		
