e2-s/nRF51-indoor-positioning-system/ble_app_indoor_pos/main.c
}						

//Function to calculate average - sliding window
static void avg_sliding_window()
{
	
	for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
		for(uint8_t cnt_sample=0 ; cnt_sample < AVG_SAMPLE_COUNT ; cnt_sample++)
			rssi_samples[cnt_node][cnt_sample] = rssi_samples[cnt_node][cnt_sample+1];
	
	for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
			rssi_samples[cnt_node][AVG_SAMPLE_COUNT] = rssi_inst[cnt_node];

	for(uint8_t cnt_node=0 ; cnt_node < NO_OF_REF_NODES ; cnt_node++)
	{
			printf("\r\n RSSI present of node %d : %d",(cnt_node+1),rssi_samples[cnt_node][AVG_SAMPLE_COUNT]);
			rssi_slide[cnt_node] = ( 0.5 * rssi_samples[cnt_node][AVG_SAMPLE_COUNT] ) + 
															( 0.2 * rssi_samples[cnt_node][AVG_SAMPLE_COUNT - 1] )	+
															( 0.2 * rssi_samples[cnt_node][AVG_SAMPLE_COUNT - 2] ) + 
															( 0.1 * rssi_samples[cnt_node][AVG_SAMPLE_COUNT - 3] );
			printf("\r\n ***RSSI slide of node %d : %d",(cnt_node+1),rssi_slide[cnt_node]);	
	}

}						


//Function to calculate distance from RSSI
static void distance_estimate()
{
		float num[NO_OF_REF_NODES],dem[NO_OF_REF_NODES];
		int8_t rssi_smooth[NO_OF_REF_NODES];
	
		//if(calc_dist)
		{
				for(uint8_t cnt=0;cnt < NO_OF_REF_NODES; cnt++)
				{
					//num[cnt] = RSSI_AVG_1M[cnt] - rssi_slide[cnt]; //using sliding window estimate
					num[cnt] = RSSI_AVG_1M[cnt] - RSSI_est[cnt]; //using Kalman Filtered RSSI
					//rssi_smooth[cnt] = ((alpha * rssi_inst[cnt]) + ((1 - alpha) * rssi_avg[cnt])); //before Kalman
					//num[cnt] = RSSI_AVG_1M[cnt] - rssi[cnt]; //before smoothing
					//num[cnt] = RSSI_AVG_1M[nt] - rssi_smooth[cnt]; //RSSI smoothing 
					dem[cnt] = 10*ENVI_CONST[cnt];
				
		//		printf("\nNumerator : %f",num[cnt]);
		//		printf("\nDenominator : %f",dem[cnt]);
					dist_rssi[cnt] = pow(10,(num[cnt]/dem[cnt]));
//					printf("\r\n RSSI Instantaneous of reference node %d : %d",(cnt+1),rssi_inst[cnt]);
//					printf("\r\n RSSI AVG of reference node %d : %d",(cnt+1),rssi_avg[cnt]);
//					printf("\r\n RSSI Smooth of reference node %d : %d",(cnt+1),rssi_smooth[cnt]);
					printf("\r\n Distance from reference node %d : %f",(cnt+1),dist_rssi[cnt]);
				}
				//calc_dist = 0;
		}
}

//Function uses Trilateration algorithm to estimate the distance of the device
static void locate_device(void)
{
		float VarA,VarB,VarC;
		float VarX32, VarX13, VarX21, VarY32, VarY13, VarY21;
		float xden,xnum,yden,ynum;
		
		VarA = ((B1X * B1X) + (B1Y * B1Y) - (dist_rssi[0] * dist_rssi[0]));
		VarB = ((B2X * B2X) + (B2Y * B2Y) - (dist_rssi[1] * dist_rssi[1]));
		VarC = ((B3X * B3X) + (B3Y * B3Y) - (dist_rssi[2] * dist_rssi[2]));
	
		VarX32 = B3X - B2X;
		VarX13 = B1X - B3X;
		VarX21 = B2X - B1X;
		
		VarY32 = B3Y - B2Y;
		VarY13 = B1Y - B3Y;
		VarY21 = B2Y - B1Y;
		
		xnum = ((VarA * VarY32) + (VarB * VarY13) + (VarC * VarY21));
		xden = 2 * ((B1X * VarY32) + (B2X * VarY13) + (B3X * VarY21));
	
		ynum = ((VarA * VarX32) + (VarB * VarX13) + (VarC * VarX21));
		yden = 2 * ((B1Y * VarX32) + (B2Y * VarX13) + (B3Y * VarX21));
	
		dev_x = xnum / xden;
		dev_y = ynum / yden;
		printf("\n\r Location of device :(%f,%f)",dev_x,dev_y); 
}

//void config_ref_node (void)
//{
//	
//		
//		uint8_t ref_node_entry2[4][6] = {{0xD9,0xA1,0x63,0x63,0x54,0xC7},
//											{0xD9,0xA1,0x63,0x63,0x54,0xC7},
//											{0xD9,0xA1,0x63,0x63,0x54,0xC7},
//											{0xD9,0xA1,0x63,0x63,0x54,0xC7}};
//	
//	
//	
//}


int main(void)
{

		//Added by Kumar for calculating Averages
//		int8_t no_avg = 100;
//		uint8_t count=0,index;
//		int16_t rssi_avg,rssi_sum = 0;
//		int8_t 	rssi_samples[100];
//		int ref_qty;
			
		//Added by Kumar for calculating Averages
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);

    uart_init();
    buttons_leds_init();
    db_discovery_init();
    ble_stack_init();
    nus_c_init();

    // Start scanning for peripherals and initiate connection
    // with devices that advertise NUS UUID.
    scan_start();
    //printf("Scan started\r\n");
		
		//Added By Kumar
		
//		printf("Enter the number of Reference nodes:\n");
//		scanf("%d",&ref_qty);
		//config_ref_node();
		//Added By Kumar
    for (;;)
    {
        //power_manage();
				//avg_rssi(100);
				//mov_avg_rssi();
				//avg_sliding_window();
				Kalman_RSSI();
				//calc_envi_const();
				distance_estimate();
				locate_device();
				nrf_delay_ms(3000);
    }
}
